src/Documents/ВозвратПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВозвратПоставщику</Name>
			<Comment>Возврат товаров поставщику</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.ВозвратОтПокупателя</xr:Item>
				<xr:Item>Document.ВводОстатковТоваров</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровКомпании</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровКомпании</xr:Item>
				<xr:Item>AccumulationRegister.ГТДПартийТоваровКомпании</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыКомпании</xr:Item>
				<xr:Item>InformationRegister.ДопроведениеПоПартиям</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик или комитент, которому мы возвращаем товар</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор, по которому ведутся взаиморасчеты с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВалютыВзаиморасчетов</Name>
					<Comment>Курс валюты взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании, с которого списываются возвращаемые поставщику товары</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен поставки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГосударственногоКонтракта</Name>
					<Comment>Идентификатор государственного контракта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоЗакрытиеСделок</Name>
					<Comment>Если флажок установлен, то при проведении документа сначала будут оплачены все незакрытые сделки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроведениеПоПроизвольнымПартиям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Возвращаемые товары и услуги</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВсего</Name>
							<Comment>Итоговая сумма по строке документа со всеми налогами</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Comment>Партия, по которой возвращаем товар</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГТД</Name>
							<Comment>Номер грузовой таможенной декларации (для товаров поступивших по импорту)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Comment>Ячейка хранения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯчейкиХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АлкогольнаяПродукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Марки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодМарки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаркировкаУпаковки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСправкиА</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСправкиБ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ДопроведениеПоПартиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДопроведениеПоПартиям</Name>
			<Comment>Список документов которые необходимо допровести по партиям</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ДоходыИРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДоходыИРасходы</Name>
			<Comment>Блок учета доходов и расходов</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоходУпр</Name>
					<Comment>Сумма дохода в управленческой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходУпр</Name>
					<Comment>Сумма расхода в управленческой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходРег</Name>
					<Comment>Сумма дохода рег.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходРег</Name>
					<Comment>Сумма расхода рег.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРаспределения</Name>
					<Comment>Статья прибыли и убытков, с которой произошло распределение суммы дохода\расхода при выполнении закрытия периода</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтатьяДоходовИРасходов</Name>
					<Comment>Статья доходов и расходов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/СтатусыПартий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыПартий</Name>
			<Comment>Статусы партий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТоварКупленный</Name>
					<Comment>Товар (купленный)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварПринятыйКомиссия</Name>
					<Comment>Товар (принятый на комиссию)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ВозвратПоставщику/Ext/ObjectModule.bsl
// Модуль документа "Возврат поставщику"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Поступление товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПоступлениеТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения,ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваровКомиссия Тогда
		ХозОперация = Справочники.ХозОперации.ВозвратТоваровПоставщикуКомиссия;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ПолученИзЕГАИС Тогда
		ТоварноТранспортнаяНакладнаяЕГАИС = ДанныеЗаполнения.ТоварноТранспортнаяНакладнаяЕГАИС;
		Комментарий = "Возврат по ТТН №" + ТоварноТранспортнаяНакладнаяЕГАИС.НомерВходящий + " от " + Формат(ТоварноТранспортнаяНакладнаяЕГАИС.ДатаВходящая,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПоступлениеТоваров()

// Производит заполнение объекта на основании документа "Ввод остатков товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ВводОстатковТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ВводОстатковТоваровПринятыхНаКомиссию Тогда
		ХозОперация = Справочники.ХозОперации.ВозвратТоваровПоставщикуКомиссия;
	КонецЕсли;

	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ВводОстатковТоваров()

// Производит заполнение объекта на основании документа "Возврат от покупателя"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ВозвратОтПокупателя(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// подставим тип цен закупки
	ТипЦен = ПравоПользователя("ОсновнойТипЦенЗакупки", ЭтотОбъект);

	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ВозвратОтПокупателя()

// Производит заполнение объекта на основании документа "Поступление товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПеремещениеТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения,ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваров Тогда
		ХозОперация = Справочники.ХозОперации.ВозвратТоваровПоставщику;
	КонецЕсли;

	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПеремещениеТоваров()

Функция ОбработкаЗаполнения_ПеремещениеТоваровПоПартиям(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА, ДанныеЗаполненияМассив = Неопределено) Экспорт
// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, "Товары") Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполненияМассив) Тогда
		Возврат Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеЗаполненияМассив[0].Контрагент) Тогда
		Контрагент = ДанныеЗаполненияМассив[0].Контрагент;
	КонецЕсли;
	
	Товары.Очистить();
	
	Для Каждого ТекСтрока ИЗ ДанныеЗаполненияМассив Цикл
		
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура				= ТекСтрока.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры	= ТекСтрока.ХарактеристикаНоменклатуры;
		Документы.ВозвратПоставщику.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока);
		НоваяСтрока.Количество 					= ТекСтрока.Количество;
		Документы.ВозвратПоставщику.ТоварыКоличествоПриИзменении(ЭтотОбъект, НоваяСтрока);
		НоваяСтрока.Партия						= ТекСтрока.Партия;
		Документы.ВозвратПоставщику.ТоварыПартияПриИзменении(ЭтотОбъект, НоваяСтрока);
		
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
	
КонецФункции // ОбработкаЗаполнения_ПеремещениеТоваров()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА

// возвращает выборку по шапке
//
// Параметры:
//  ДокументСсылка - Ссылка на документ для которого получаем шапку.
//
// Возвращаемое значение:
//  Выборка - выборка по шапке
//
Функция ПолучитьШапкуДокумента(ДокументСсылка)
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	СУММА(ВозвратПоставщикуТовары.СуммаВсего) КАК СуммаВсего
	|ПОМЕСТИТЬ ДокТовары
	|ИЗ
	|	Документ.ВозвратПоставщику.Товары КАК ВозвратПоставщикуТовары
	|ГДЕ
	|	ВозвратПоставщикуТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата,
	|	Док.ВалютаДокумента КАК ВалютаДокумента,
	|	Док.КурсДокумента КАК КурсДокумента,
	|	Док.ТипЦен КАК ТипЦен,
	|	Док.ХозОперация КАК ХозОперация,
	|	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	|	Док.КурсВалютыВзаиморасчетов КАК КурсВалютыВзаиморасчетов,
	|	Док.МоментВремени КАК МоментВремени,
	|	Док.Организация КАК Организация,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	Док.Проект КАК Проект,
	|	Док.СкладКомпании КАК СкладКомпании,
	|	Док.Контрагент КАК Контрагент,
	|	Док.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	Док.ДокументОснование КАК ДокументОснование,
	|	Док.ПроведениеПоПроизвольнымПартиям,
	|	ЕСТЬNULL(ДокТовары.СуммаВсего, 0) КАК СуммаВсего
	|ИЗ
	|	Документ.ВозвратПоставщику КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокТовары КАК ДокТовары
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Док.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции // ПолучитьШапкуДокумента()

// формирует движения документа по партионным регистрам
//
// Параметры:
//  Режим           - режим проведения (оперативный/неоперативный)
//  ДокументСсылка  - ссылка на документ который надо допровести по партиям.
//
// Возвращаемое значение:
//  Возвращает Истина - все ОК, ложь - чего-то не так.
//
Функция ПровестиПоПартиям(Режим,ДокументСсылка) Экспорт
	Отказ=Ложь;
	
	// получим шапку документа
	ШапкаДокумента=ПолучитьШапкуДокумента(ДокументСсылка);
	
	// Получим способ ведения баланса.
	БалансВедетсяПоПодразделениям = БалансВедетсяПоПодразделениям(ШапкаДокумента.Дата);
		
	// Определим необходимость корректирующих проводок для поддержания баланса по подразделениям.
	ПодразделениеСклад                 = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(СкладКомпании.ПодразделениеКомпании, ШапкаДокумента.Дата);
	ПодразделениеДоговорВзаиморасчетов = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(ДоговорВзаиморасчетов.ПодразделениеКомпании, ШапкаДокумента.Дата);
	БалансовыеПодразделенияНеРавны     = (ПодразделениеДоговорВзаиморасчетов<>ПодразделениеСклад);
	
	// Проверим, если подразделение проводиться по партиям "отложенно", то дальше не идем.
	НаборЗаписейДопроведениеПоПартиям=Движения.ДопроведениеПоПартиям;
	НаборЗаписейДопроведениеПоПартиям.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейДопроведениеПоПартиям.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейДопроведениеПоПартиям.Зафиксировать() ИЛИ Отказ;
	Если НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
		// Доходы и расходы на себестоимость не оприходованных партий
		Если ШапкаДокумента.ХозОперация<>Справочники.ХозОперации.ВозвратТоваровПоставщикуКомиссия Тогда
			НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
			НаборЗаписейДоходыИРасходы.ДокументОбъект         = ЭтотОбъект;
			НаборЗаписейДоходыИРасходы.Подразделение          = ШапкаДокумента.ДоговорВзаиморасчетов.ПодразделениеКомпании;
			НаборЗаписейДоходыИРасходы.ВУпрВалюте             = Ложь;
			НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СебестоимостьНеоприходованныхПартий;
			НаборЗаписейДоходыИРасходы.Доход                  = ШапкаДокумента.СуммаВсего;
			НаборЗаписейДоходыИРасходы.ШапкаДокумента         = ШапкаДокумента;
			Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
		КонецЕсли;
		
		Возврат НЕ Отказ;
	КонецЕсли;
	
	НаборЗаписейПартии=Движения.ПартииТоваровКомпании;
	НаборЗаписейПартии.ДокументОбъект            = ЭтотОбъект;
	НаборЗаписейПартии.СкладКомпании             = ШапкаДокумента.СкладКомпании;
	НаборЗаписейПартии.Организация               = ШапкаДокумента.Организация;
	НаборЗаписейПартии.РезультатЗапросаПоТоварам = Неопределено;
	НаборЗаписейПартии.ИмяРеквизитаДокумент      = "Партия";
	НаборЗаписейПартии.Сторно                    = Истина;
	НаборЗаписейПартии.ШапкаДокумента            = ШапкаДокумента;
	НаборЗаписейПартии.СтатусПартии              = ?(ШапкаДокумента.ХозОперация=Справочники.ХозОперации.ВозвратТоваровПоставщикуКомиссия,Перечисления.СтатусыПартий.ТоварПринятыйКомиссия,Перечисления.СтатусыПартий.ТоварКупленный);
	НаборЗаписейПартии.ПроведениеПоПроизвольнымПартиям = ШапкаДокумента.ПроведениеПоПроизвольнымПартиям;
	Отказ=НЕ НаборЗаписейПартии.Приход() ИЛИ Отказ;
	
	// Движения по Доходам и Расходам
	Если ШапкаДокумента.ХозОперация<>Справочники.ХозОперации.ВозвратТоваровПоставщикуКомиссия Тогда
		// определим суммы для товаров и услуг в документе
		СуммаУслуг=0;
		СуммаТоваров=0;
		Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР КОГДА ДокументТовары.Номенклатура.ВидНоменклатуры =  &Услуга ТОГДА ДокументТовары.СуммаВсего ИНАЧЕ 0 КОНЕЦ) КАК СуммаУслуг,
		|	СУММА(ВЫБОР КОГДА ДокументТовары.Номенклатура.ВидНоменклатуры <> &Услуга ТОГДА ДокументТовары.СуммаВсего ИНАЧЕ 0 КОНЕЦ) КАК СуммаТоваров
		|ИЗ
		|	Документ.ВозвратПоставщику.Товары КАК ДокументТовары
		|ГДЕ
		|	ДокументТовары.Ссылка = &ДокументСсылка
		|
		|");
		Запрос.УстановитьПараметр("ДокументСсылка",ШапкаДокумента.Ссылка);
		Запрос.УстановитьПараметр("Услуга",Перечисления.ВидыНоменклатуры.Услуга);
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СуммаУслуг	 = Выборка.СуммаУслуг;
			СуммаТоваров = Выборка.СуммаТоваров;
		КонецЕсли;
		
		ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		Если ЗначениеЗаполнено(ШапкаДокумента.КурсВалютыУпр) Тогда
			КурсУпр        = ШапкаДокумента.КурсВалютыУпр;
		Иначе
			СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаУпр,Дата);
			КурсУпр 	   = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		КонецЕсли;	
		
		СуммаУслуг   = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаУслуг,  ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,КурсУпр);
		СуммаТоваров = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаТоваров,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,КурсУпр);
		ДоходТовары	 = -НаборЗаписейПартии.Итог("СуммаУпр");
		
		Если (НЕ БалансВедетсяПоПодразделениям ИЛИ  Не БалансовыеПодразделенияНеРавны) И УправлениеДиалогомСервер.ПолучитьМодульЧисла(СуммаТоваров-ДоходТовары)>=0.01 Тогда	
			// запишем суммы в регистр
			НаборЗаписейДиР 						= Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект 			= ЭтотОбъект;
			НаборЗаписейДиР.СтатьяДоходовИРасходов	= Справочники.СтатьиДоходовИРасходов.ОтклонениеСтоимостиВозврата;
			Если БалансВедетсяПоПодразделениям Тогда
				НаборЗаписейДиР.Подразделение = ШапкаДокумента.СкладКомпании.ПодразделениеКомпании;
			КонецЕсли;
			НаборЗаписейДиР.ВУпрВалюте				= Истина;
			НаборЗаписейДиР.Доход					= СуммаТоваров-ДоходТовары;
			НаборЗаписейДиР.ШапкаДокумента			= ШапкаДокумента;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли;
		
		// если возвращали услуги
		Если СуммаУслуг<>0 Тогда
			НаборЗаписейДиР.ДокументОбъект 			= ЭтотОбъект;
			НаборЗаписейДиР.СтатьяДоходовИРасходов	= Справочники.СтатьиДоходовИРасходов.ВозвратУслугПоставщика;
			Если БалансВедетсяПоПодразделениям Тогда
				НаборЗаписейДиР.Подразделение		= ШапкаДокумента.ДоговорВзаиморасчетов.ПодразделениеКомпании;
			КонецЕсли;
			НаборЗаписейДиР.ВУпрВалюте				= Истина;
			НаборЗаписейДиР.Доход					= СуммаУслуг;
			НаборЗаписейДиР.ШапкаДокумента			= ШапкаДокумента;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли;
		
		Если БалансВедетсяПоПодразделениям И БалансовыеПодразделенияНеРавны Тогда	
			// запишем суммы в регистр
			НаборЗаписейДиР 						= Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект 			= ЭтотОбъект;
			НаборЗаписейДиР.СтатьяДоходовИРасходов	= Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
			НаборЗаписейДиР.Подразделение			= ШапкаДокумента.ДоговорВзаиморасчетов.ПодразделениеКомпании;
			НаборЗаписейДиР.ВУпрВалюте				= Истина;
			НаборЗаписейДиР.Расход					= СуммаУслуг;
			НаборЗаписейДиР.ШапкаДокумента			= ШапкаДокумента;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли;

	КонецЕсли;
	
	// двигаем границу последовательности партий
	Если Ссылка <> ДокументСсылка Тогда
		
		РаботаСГраницами.МоментВремениПередПроведением(ДокументСсылка, ДополнительныеСвойства);
		РаботаСГраницами.ДвиженияПоПартиямПередПроведением(ДокументСсылка, ДополнительныеСвойства);
		
	КонецЕсли;
	
	РаботаСГраницами.СдвинутьГраницуПартий(ДокументСсылка, ДополнительныеСвойства, Движения);
	
	Возврат НЕ Отказ;
КонецФункции // ПровестиПоПартиям()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) И ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		ХозОперация = Справочники.ХозОперации.ВозвратТоваровПоставщику;
	КонецЕсли;
	
	ЗаполнятьТЧ = Истина;
//	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") И ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваров Тогда
//		ЗаполнятьТЧ = Ложь;
//	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") И ТипЗнч(ДанныеЗаполнения) <> Тип("СправочникСсылка.Контрагенты") И ЗаполнятьТЧ Тогда
		Документы.ВозвратПоставщику.ЗаполнитьТабличнуюЧастьНаОсновании(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ДокументЗаполнения") И ТипЗнч(ДанныеЗаполнения.ДокументЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ДанныеЗаполненияМассив = ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "ДанныеЗаполнения", Неопределено);
			ОбработкаЗаполнения_ПеремещениеТоваровПоПартиям(ДанныеЗаполнения.ДокументЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, ДанныеЗаполненияМассив);
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеСвойства.ПараметрыДействия.Свойство("ТребуетсяУстановкаЦен") Тогда
		ДополнительныеСвойства.ПараметрыДействия.ТребуетсяУстановкаЦен = Ложь;
	КонецЕсли;
	
	ПроведениеПоПроизвольнымПартиям = Документы.ВозвратПоставщику.ПолучитьПравоПроведенияПоПроизвольнымПартиям(ЭтотОбъект);
	
	ИдентификаторГосударственногоКонтракта = ?(ЗначениеЗаполнено(ИдентификаторГосударственногоКонтракта),
		ИдентификаторГосударственногоКонтракта,
		ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОснование) И НЕ ТипЗнч(ДокументОснование)= Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		
		Если ДокументОснование.Контрагент <> Контрагент Тогда
			ВывестиСообщение(НСтр("ru='Контрагент документа основания отличается от контрагента текущего документа.'"), ЭтотОбъект,,,Отказ);
		КонецЕсли;
		
		Если ДокументОснование.ДоговорВзаиморасчетов <> ДоговорВзаиморасчетов Тогда
			ВывестиСообщение(НСтр("ru='Договор взаиморасчетов документа основания отличается от договора взаиморасчетов текущего документа.'"), ЭтотОбъект,,,Отказ);
		КонецЕсли;
		
	КонецЕсли; 	

КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТабличнойЧасти Из Товары Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ИдентификаторСтроки) Тогда
			СтрокаТабличнойЧасти.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЦикла;
	
	//ИнтеграцияЕГАИС.ЗаписатьСоответствиеНоменклатуры(Товары);
	
	РаботаСГраницами.МоментВремениПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоВзаиморасчетамПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоПартиямПередПроведением(Ссылка, ДополнительныеСвойства);
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// Получим способ ведения баланса.
	БалансВедетсяПоПодразделениям = БалансВедетсяПоПодразделениям(Дата);
	
	// Определим необходимость корректирующих проводок, для поддержания баланса по подразделениям.
	ПодразделениеСклад                 = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(СкладКомпании.ПодразделениеКомпании, Дата);
	ПодразделениеДоговорВзаиморасчетов = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(ДоговорВзаиморасчетов.ПодразделениеКомпании, Дата);
	БалансовыеПодразделенияНеРавны     = (ПодразделениеДоговорВзаиморасчетов<>ПодразделениеСклад);
	Если СкладКомпании.Розничный И ПодразделениеКомпании.ПереоценкаРозницаПоРасходу Тогда
		ТаблицаПоТоварам = Документы.ВозвратПоставщику.ПолучитьТаблицуТоваров(ЭтотОбъект);
		СписыватьРозницуПоОстаткам=Ложь;
	Иначе
		ТаблицаПоТоварам=Неопределено;
		СписыватьРозницуПоОстаткам=Истина;
	КонецЕсли;
	
	// проведем остатки товаров
	НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
	НаборЗаписейОстатки.РежимПроведения=РежимПроведения;
	НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейОстатки.РезультатЗапросаПоТоварам=ТаблицаПоТоварам;
	НаборЗаписейОстатки.СкладКомпании=СкладКомпании;
	НаборЗаписейОстатки.Приходовать=Истина;
	НаборЗаписейОстатки.СписыватьРозницуПоОстаткам=СписыватьРозницуПоОстаткам;
	НаборЗаписейОстатки.ДвиженияПоРознице=СкладКомпании.Розничный;
	НаборЗаписейОстатки.Контрагент=Контрагент;
	НаборЗаписейОстатки.ИмяРеквизитаЦенаРозничная="Цена";
	НаборЗаписейОстатки.ИмяРеквизитаСуммаРозничная="Сумма";
	Отказ=НЕ НаборЗаписейОстатки.Расход() ИЛИ Отказ;
	Если Отказ Тогда
		Возврат; // дальше смысла не имеет
	КонецЕсли;
	
	// проведем взаиморасчеты
	Если ХозОперация<>Справочники.ХозОперации.ВозвратТоваровПоставщикуКомиссия Тогда
		НаборЗаписейВзаиморасчеты=Движения.ВзаиморасчетыКомпании;
		НаборЗаписейВзаиморасчеты.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейВзаиморасчеты.РежимПроведения=РежимПроведения;
		НаборЗаписейВзаиморасчеты.Контрагент=Контрагент;
		НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов=ДоговорВзаиморасчетов;
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			Если ЕстьРеквизит(ДокументОснование,"ДокументОснование") И ТипЗнч(ДокументОснование.ДокументОснование)=Тип("ДокументСсылка.ЗаказПоставщику")
				И ДоговорВзаиморасчетов.СпособЗакрытияСделок=Перечисления.СпособЗакрытияСделок.ПоСчетамИЗаказам Тогда
				НаборЗаписейВзаиморасчеты.Сделка = ДокументОснование.ДокументОснование;
			Иначе
				НаборЗаписейВзаиморасчеты.Сделка = ДокументОснование;
			КонецЕсли;
			НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем=Ложь;
		Иначе
			НаборЗаписейВзаиморасчеты.Сделка=Неопределено;
		КонецЕсли;
		НаборЗаписейВзаиморасчеты.АвтоЗакрытиеСделок=АвтоЗакрытиеСделок;
		НаборЗаписейВзаиморасчеты.Сумма=СуммаДокумента;
		НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц=0;
		Отказ=НЕ НаборЗаписейВзаиморасчеты.Приход() ИЛИ Отказ;
		
		// Доходы и расходы по суммовым разницам.
		СуммаДоходаРасходаСуммовыхРазниц=НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
		Если СуммаДоходаРасходаСуммовыхРазниц<>0 Тогда
			НаборЗаписейДиР = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
			Если БалансВедетсяПоПодразделениям Тогда
				НаборЗаписейДиР.Подразделение = ДоговорВзаиморасчетов.ПодразделениеКомпании;
			КонецЕсли;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
			НаборЗаписейДиР.ВУпрВалюте = Истина;
			Если СуммаДоходаРасходаСуммовыхРазниц<0 Тогда
				НаборЗаписейДиР.Расход = -СуммаДоходаРасходаСуммовыхРазниц;
			Иначе
				НаборЗаписейДиР.Доход = СуммаДоходаРасходаСуммовыхРазниц;
			КонецЕсли;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли;
	КонецЕсли;
	
	// Проведем партии товаров.
	Отказ=НЕ ПровестиПоПартиям(РежимПроведения,Ссылка) ИЛИ Отказ;
	
	// Способ ведения не по подразделениям или балансовые подразделения равны то ничего не будем корректировать.
	// Комиссионный товар не на балансе.
	Если ХозОперация<>Справочники.ХозОперации.ВозвратТоваровПоставщикуКомиссия И БалансВедетсяПоПодразделениям И БалансовыеПодразделенияНеРавны Тогда
		
		СуммаВзаиморасчетов = Движения.ВзаиморасчетыКомпании.Итог("СуммаУпр");
		СуммаПартий = -Движения.ПартииТоваровКомпании.Итог("СуммаУпр");
		Если СуммаПартий<>0 Тогда
			НаборЗаписейДиР = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
			НаборЗаписейДиР.Подразделение = СкладКомпании.ПодразделениеКомпании;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
			НаборЗаписейДиР.ВУпрВалюте = Истина;
			НаборЗаписейДиР.Доход = СуммаПартий;
			Отказ = НЕ НаборЗаписейДиР.Расход() ИЛИ Отказ;	
		КонецЕсли;
		
		НаборЗаписейДиР = Движения.ДоходыИРасходы;
		НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
		НаборЗаписейДиР.Подразделение = ДоговорВзаиморасчетов.ПодразделениеКомпании;
		НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
		НаборЗаписейДиР.ВУпрВалюте = Ложь;
		НаборЗаписейДиР.Доход = СуммаДокумента;
		Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;	
		
	КонецЕсли;	
	
	// Возможно расхождение баланса на "копейки" из-за округления. Возникшую разницу
	// необходимо списать на доходы и расходы.
	Отказ = НЕ ОбработкаСобытийДокументаСервер.СписаниеКопейкиПриОкругленииВалютныхСчетов(ЭтотОбъект) ИЛИ Отказ;	
	
	// двигаем границу последовательности взаиморасчетов
	РаботаСГраницами.СдвинутьГраницуВзаиморасчетов(Ссылка, ДополнительныеСвойства, Движения);
	
	Если ПолучитьЗначениеУчетнойПолитики("ПравилоПроверкиХарактеристики",, Дата) = Ложь Тогда
		Возврат;
	КонецЕсли;
	//проставим характеристики в ТЧ документа
	Если НЕ Отказ Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВнешнийИсточник.Номенклатура КАК Номенклатура,
		|	ВнешнийИсточник.ХарактеристикаНоменклатуры КАК Характеристика,
		|	ВнешнийИсточник.Количество КАК Количество
		|ПОМЕСТИТЬ ТаблицаДвижений
		|ИЗ
		|	&ВнешнийИсточник КАК ВнешнийИсточник
		|ГДЕ
		|	ВнешнийИсточник.ХозОперация = &ХозОперация
		|	И ВнешнийИсточник.ХарактеристикаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|	И ВнешнийИсточник.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДвижений.Номенклатура КАК Номенклатура,
		|	ТаблицаДвижений.Характеристика КАК Характеристика,
		|	СУММА(ТаблицаДвижений.Количество) КАК Количество
		|ИЗ
		|	ТаблицаДвижений КАК ТаблицаДвижений
		|ГДЕ
		|	НЕ ТаблицаДвижений.Характеристика В (&Характеристики)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДвижений.Номенклатура,
		|	ТаблицаДвижений.Характеристика
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТаблицаДвижений.Количество) <> 0");
		Запрос.УстановитьПараметр("ВнешнийИсточник", Движения.ПартииТоваровКомпании.Выгрузить());
		Запрос.УстановитьПараметр("ХозОперация", ХозОперация);
		Запрос.УстановитьПараметр("Характеристики", Товары.ВыгрузитьКолонку("ХарактеристикаНоменклатуры"));
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ТаблицаДвижений = РезультатЗапроса.Выгрузить();
			СтруктураОтбора = Новый Структура("Номенклатура");
			Для Каждого СтрокаТовар Из Товары Цикл
				Если ЗначениеЗаполнено(СтрокаТовар.ХарактеристикаНоменклатуры) Тогда 
					Продолжить; 
				КонецЕсли;
				//запомним исходные данные
				СуммаСтроки = СтрокаТовар.СуммаВсего;
				СуммаНДССтроки = СтрокаТовар.СуммаНДС;
				СуммаИтого = 0; 
				СуммаНДСИтого = 0;
				СтруктураОтбора.Номенклатура = СтрокаТовар.Номенклатура;
				МассивНайденныхСтрок = ТаблицаДвижений.НайтиСтроки(СтруктураОтбора);
				Если МассивНайденныхСтрок.Количество()=0 Тогда 
					Продолжить; 
				КонецЕсли;
				Для ЭлементМассива=0 По МассивНайденныхСтрок.ВГраница() Цикл
					ТекСтрока = МассивНайденныхСтрок[ЭлементМассива];
					Если ТекСтрока.Количество=NULL ИЛИ ТекСтрока.Количество=0 Тогда 
						Продолжить; 
					КонецЕсли;
					Если СтрокаТовар.КоличествоБазовое>ТекСтрока.Количество Тогда
						//разбиваем строку
						СтрокаТовар.КоличествоБазовое = СтрокаТовар.КоличествоБазовое - ТекСтрока.Количество;
						Документы.ВозвратПоставщику.ТоварыКоличествоПриИзменении(ЭтотОбъект, СтрокаТовар);
						
						НоваяСтрока = Товары.Вставить(Товары.Индекс(СтрокаТовар));// + 1 + Сч);
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовар);
						НоваяСтрока.ХарактеристикаНоменклатуры = ТекСтрока.Характеристика;
						НоваяСтрока.КоличествоБазовое = ТекСтрока.Количество;
						Документы.ВозвратПоставщику.ТоварыКоличествоПриИзменении(ЭтотОбъект, НоваяСтрока);
						НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
						СуммаИтого = СуммаИтого + НоваяСтрока.СуммаВсего;
						СуммаНДСИтого = СуммаНДСИтого + НоваяСтрока.СуммаНДС;
						ТаблицаДвижений.Удалить(ТекСтрока);
					Иначе
						СтрокаТовар.ХарактеристикаНоменклатуры = ТекСтрока.Характеристика;
						СуммаИтого = СуммаИтого + СтрокаТовар.СуммаВсего;
						СуммаНДСИтого = СуммаНДСИтого + СтрокаТовар.СуммаНДС;
						Если СтрокаТовар.КоличествоБазовое<ТекСтрока.Количество Тогда
							ТекСтрока.Количество = ТекСтрока.Количество - СтрокаТовар.КоличествоБазовое;
						Иначе
							ТаблицаДвижений.Удалить(ТекСтрока);
						КонецЕсли;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				//проверим результат
				РазницаСуммы = СуммаСтроки - СуммаИтого;
				Если РазницаСуммы<>0 ТОгда
					СтрокаТовар.СуммаВсего = СтрокаТовар.СуммаВсего + РазницаСуммы;
				КонецЕсли;
				РазницаНДС = СуммаНДССтроки - СуммаНДСИтого;
				Если РазницаНДС<>0 Тогда
					СтрокаТовар.СуммаНДС = СтрокаТовар.СуммаНДС + РазницаНДС;
				КонецЕсли;
			КонецЦикла;
			
			// если модифицировали документ, то запишем его
			Если НЕ Отказ И Модифицированность() Тогда
				ОбменДанными.Загрузка = Истина;
				Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли
